# Задание 1
Реализовать Console.ReadLine через Console.ReadKey

Тело функции - string CustomReadLine()


- Пример работы

```csharp
var s = CustomReadLine(); // Тут пользователь вводит текст, по нажатии Enter - работа ее завершается

Console.WriteLine(s); // то что ввел пользователь
```




# Задание 2
1. Написать программу, которая принимает целые числа для сложения
2. Программа должна выводить "введите первое число: ",
   в той же строке считывает целое число
3. Программа должна выводить "введите второе число: ",
   в той же строке считывает число
4. Введенные значения - складываем
5. После этого выводим выражение в формате

	число1 + число2 = ответ


	Пример:
```console
Результат сложения: 100 + 200 = 300
```


# Задание 3. Со звездочкой

Программа выводит первой строкой введенный текст с большой буквы
Второй строке обычный текст, перед эти выводя фиксированный
```
Исходный текст
```
Чтобы из обычной буквы сделать большую, воспользуйтесь функцией `char.ToUpper(char)`

```
char.ToUpper('б')  => Б
```


Пример
ОТУС ЭТО ШКОЛА
Отус этО шкоЛа

# Задание 4. C двумя звездочками

Есть функция Start - меню игры на стрелочках, нужно доделать ее таким образом,
чтобы смена стрелочки менялась без очистки экрана, т.е. воспользоваться GetCursorPosition, SetCursorPosition
Избавиться от Console.Clear()





